commands_templates/SetVideoSourceConfiguration1.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/media/wsdl" xmlns:sch="http://www.onvif.org/ver10/schema">
   <soap:Header/>
   <soap:Body>
      <wsdl:SetVideoSourceConfiguration>
         <wsdl:Configuration token="?">
            <!--type: Name-->
            <sch:Name>?</sch:Name>
            <!--type: int-->
            <sch:UseCount>?</sch:UseCount>
            <!--type: ReferenceToken-->
            <sch:SourceToken>?</sch:SourceToken>
            <sch:Bounds x="?" y="?" width="?" height="?"/>
            <!--You may enter ANY elements at this point-->
            <!--Optional:-->
            <sch:Extension>
               <!--Optional:-->
               <sch:Rotate>
                  <!--type: RotateMode - enumeration: [OFF,ON,AUTO]-->
                  <sch:Mode>?</sch:Mode>
                  <!--Optional:-->
                  <!--type: int-->
                  <sch:Degree>?</sch:Degree>
                  <!--Optional:-->
                  <sch:Extension>
                     <!--You may enter ANY elements at this point-->
                  </sch:Extension>
               </sch:Rotate>
               <!--Optional:-->
               <sch:Extension>
                  <!--You may enter ANY elements at this point-->
               </sch:Extension>
            </sch:Extension>
         </wsdl:Configuration>
         <!--type: boolean-->
         <wsdl:ForcePersistence>?</wsdl:ForcePersistence>
      </wsdl:SetVideoSourceConfiguration>
   </soap:Body>
</soap:Envelope>